Итоговый_проект_2/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>InformationRegister.Скидки</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>НоменклатураНоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Итоговый_проект_2/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Итоговый_проект_2/src/Documents/УстановкаСкидок/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Переопределить событие ОбработкаПроведения, формируя движения по регистру сведений Скидки датой документа
	Движения.Скидки.Записывать = Истина;
	
	Для каждого ТекСтрокаСкидки из Скидки Цикл
		
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрокаСкидки.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекСтрокаСкидки.Скидка;
		
	КонецЦикла;
	
КонецПроцедуры
